print('Фильм «Пятница»,\n'
      'сеансы: 12 часов – 250 руб, 16 – 350 руб, 20 – 450 руб.\n'
      'Фильм «Чемпионы»,\n'
      'сеансы: 10 часов – 250 руб, 13 – 350 руб, 16 – 350 руб.\n'
      'Фильм «Пернатая банда»,\n'
      'сеансы: 10 часов – 350 руб, 14 – 450 руб, 18 – 450 руб.\n'
      'от 20 человек - скидка 20%,\n'
      'заказ за день до сеанса - скидка 5%\n')
choose_film = str(input("Выберите фильм(Пятница, Чемпионы, Пернатая банда): ").lower())
choose_date = input("Выберите дату(Сегодня, завтра): ")
s_time = str(input("Выберите время: "))
tickets = int(input("Укажите кол-во билетов: "))
price = 0

film_price = {"пятница": {'12': 250, '16': 350, '20': 40},
              "чемпионы": {'10': 250, '13': 350, '16': 350},
              "пернатая банда": {'10': 350, '14': 450, '18': 450}
              }
if tickets >= 20:
    price = (film_price[choose_film][s_time]) - (film_price[choose_film][s_time] * 0.2)
else:
    price = (film_price[choose_film][s_time]) - (film_price[choose_film][s_time] * 0.05)
if price != 0:
    print("\nВыбран фильм: {}\nДень: {}\nВремя: {}\nКол-во билетов: {}\nРезульта: {}".format(choose_film, choose_date, s_time, tickets, price))
else:
    print("Ошибка ввода")
